{
  "#": 38,
  "%10": 156,
  "%11": 170,
  "%12": 202,
  "%13": 217,
  "%14": 298,
  "%15": 327,
  "%16": 355,
  "%17": 370,
  "%18": 379,
  "%19": 388,
  "%20": 389,
  "%21": 398,
  "%22": 399,
  "%23": 419,
  "%24": 450,
  "(": 17,
  ")": 18,
  "*": 256,
  "-": 31,
  ".": 24,
  "/": 39,
  "1": 20,
  "2": 21,
  "3": 26,
  "4": 32,
  "5": 43,
  "6": 58,
  "7": 76,
  "8": 98,
  "9": 124,
  "=": 22,
  ">>": 29,
  "B": 54,
  "Br": 37,
  "C": 16,
  "Cl": 28,
  "F": 27,
  "I": 48,
  "N": 23,
  "O": 19,
  "P": 45,
  "S": 34,
  "[10B]": 468,
  "[118Sn]": 560,
  "[11CH3]": 284,
  "[11C]": 422,
  "[11c]": 548,
  "[123I-]": 368,
  "[123I]": 313,
  "[124I-]": 578,
  "[124I]": 425,
  "[125I]": 363,
  "[131I]": 503,
  "[13C@@H]": 464,
  "[13C@H]": 482,
  "[13CH2]": 265,
  "[13CH3]": 260,
  "[13CH]": 423,
  "[13C]": 228,
  "[13N]": 586,
  "[13cH]": 279,
  "[13c]": 227,
  "[14C@H]": 508,
  "[14CH2]": 555,
  "[14CH3]": 407,
  "[14CH]": 381,
  "[14C]": 302,
  "[14cH]": 480,
  "[14c]": 369,
  "[153Sm]": 561,
  "[15CH]": 574,
  "[15NH2]": 336,
  "[15NH]": 395,
  "[15N]": 404,
  "[15OH2]": 587,
  "[15nH]": 523,
  "[15n]": 401,
  "[18F-]": 340,
  "[18F]": 172,
  "[18OH2]": 557,
  "[18OH]": 491,
  "[18O]": 451,
  "[19F]": 378,
  "[1H]": 522,
  "[211At]": 509,
  "[229Th]": 533,
  "[24NaH]": 572,
  "[2H]": 64,
  "[2NH]": 588,
  "[31P]": 495,
  "[32P]": 435,
  "[35S]": 497,
  "[3H]": 257,
  "[60Co]": 488,
  "[64Cu]": 519,
  "[67Ga+3]": 584,
  "[67Ga]": 585,
  "[68Ga]": 458,
  "[7NaH]": 539,
  "[99Tc]": 463,
  "[9CH3]": 564,
  "[9CH]": 563,
  "[Ac-]": 558,
  "[AcH]": 550,
  "[Ac]": 130,
  "[Ag+2]": 318,
  "[Ag+3]": 449,
  "[Ag+]": 118,
  "[Ag-]": 259,
  "[Ag]": 123,
  "[Al+2]": 402,
  "[Al+3]": 110,
  "[Al+]": 247,
  "[Al-]": 225,
  "[AlH-]": 272,
  "[AlH2+]": 524,
  "[AlH2-]": 196,
  "[AlH2]": 377,
  "[AlH3]": 333,
  "[AlH4-]": 103,
  "[AlH4]": 95,
  "[AlH]": 101,
  "[Al]": 90,
  "[ArH]": 499,
  "[Ar]": 222,
  "[As+3]": 535,
  "[As+]": 443,
  "[As-]": 322,
  "[AsH+]": 529,
  "[AsH2]": 483,
  "[AsH3]": 490,
  "[AsH4+]": 489,
  "[AsH]": 474,
  "[As]": 184,
  "[At]": 576,
  "[Au+3]": 357,
  "[Au+]": 400,
  "[Au-]": 397,
  "[Au]": 212,
  "[B+2]": 506,
  "[B+3]": 275,
  "[B+]": 305,
  "[B-]": 88,
  "[BH-]": 81,
  "[BH2-]": 502,
  "[BH2]": 442,
  "[BH3-]": 92,
  "[BH4-]": 74,
  "[BH]": 384,
  "[B]": 167,
  "[Ba+2]": 169,
  "[Ba+]": 475,
  "[BaH2]": 530,
  "[BaH]": 531,
  "[Ba]": 207,
  "[Be+2]": 392,
  "[Be]": 385,
  "[Bi+2]": 460,
  "[Bi+3]": 237,
  "[Bi+5]": 571,
  "[Bi+]": 540,
  "[BiH3]": 526,
  "[Bi]": 179,
  "[Br+2]": 238,
  "[Br+]": 350,
  "[Br-]": 85,
  "[BrH+]": 479,
  "[Br]": 218,
  "[C+4]": 393,
  "[C+]": 146,
  "[C-2]": 570,
  "[C-4]": 358,
  "[C-]": 86,
  "[C@@H]": 35,
  "[C@@]": 56,
  "[C@H]": 33,
  "[C@]": 55,
  "[CH+]": 191,
  "[CH-]": 188,
  "[CH2+]": 155,
  "[CH2-]": 157,
  "[CH2]": 158,
  "[CH3+]": 317,
  "[CH3-]": 233,
  "[CH3]": 293,
  "[CH]": 83,
  "[CLS]": 12,
  "[C]": 94,
  "[Ca+2]": 122,
  "[Ca+]": 547,
  "[CaH2]": 346,
  "[Ca]": 128,
  "[Cd+2]": 309,
  "[Cd+]": 521,
  "[Cd]": 289,
  "[Ce+2]": 461,
  "[Ce+3]": 194,
  "[Ce+4]": 160,
  "[Ce]": 166,
  "[Cf]": 444,
  "[Cl+2]": 271,
  "[Cl+3]": 134,
  "[Cl+]": 138,
  "[Cl-]": 57,
  "[ClH+]": 409,
  "[ClH2+]": 445,
  "[Cl]": 229,
  "[Cm]": 430,
  "[Cn]": 590,
  "[Co+2]": 182,
  "[Co+3]": 310,
  "[Co+]": 500,
  "[Co]": 162,
  "[Cr+2]": 299,
  "[Cr+3]": 211,
  "[Cr+4]": 408,
  "[Cr+6]": 290,
  "[Cr+]": 471,
  "[Cr-]": 514,
  "[Cr]": 105,
  "[Cs+]": 68,
  "[Cs]": 70,
  "[Cu+2]": 99,
  "[Cu+3]": 469,
  "[Cu+]": 131,
  "[Cu-2]": 276,
  "[Cu-]": 224,
  "[CuH2-]": 579,
  "[CuH2]": 494,
  "[Cu]": 75,
  "[Dy+3]": 418,
  "[Dy]": 473,
  "[Er+3]": 367,
  "[Er]": 424,
  "[Eu+3]": 323,
  "[Eu]": 364,
  "[F+]": 441,
  "[F-]": 89,
  "[FH+2]": 525,
  "[F]": 427,
  "[Fe+2]": 78,
  "[Fe+3]": 152,
  "[Fe+4]": 532,
  "[Fe+6]": 465,
  "[Fe-3]": 171,
  "[Fe-4]": 280,
  "[Fe]": 93,
  "[Fm]": 415,
  "[Fr]": 573,
  "[Ga+3]": 345,
  "[Ga+]": 429,
  "[Ga]": 281,
  "[Gd+3]": 264,
  "[Gd]": 339,
  "[GeH2]": 467,
  "[GeH3]": 431,
  "[GeH]": 349,
  "[Ge]": 209,
  "[H+]": 140,
  "[H-]": 72,
  "[H]": 63,
  "[HeH]": 551,
  "[Hf+2]": 295,
  "[Hf+3]": 420,
  "[Hf+4]": 301,
  "[Hf]": 285,
  "[Hg+2]": 186,
  "[Hg+]": 283,
  "[Hg]": 148,
  "[Ho+3]": 457,
  "[Ho]": 589,
  "[I+2]": 221,
  "[I+3]": 120,
  "[I+]": 163,
  "[I-]": 84,
  "[IH+]": 326,
  "[IH-]": 432,
  "[IH2+]": 330,
  "[IH]": 361,
  "[I]": 144,
  "[In+2]": 484,
  "[In+3]": 266,
  "[In+]": 477,
  "[In]": 192,
  "[Ir+2]": 438,
  "[Ir+3]": 332,
  "[Ir+4]": 583,
  "[Ir+]": 375,
  "[Ir-]": 391,
  "[IrH2]": 512,
  "[IrH]": 511,
  "[Ir]": 178,
  "[K+]": 51,
  "[KH]": 193,
  "[K]": 52,
  "[La+3]": 240,
  "[LaH]": 426,
  "[La]": 239,
  "[Li+]": 69,
  "[Li-]": 538,
  "[LiH]": 213,
  "[Li]": 62,
  "[Lu]": 337,
  "[MASK]": 14,
  "[Mg+2]": 106,
  "[Mg+]": 147,
  "[MgH]": 582,
  "[Mg]": 77,
  "[Mn+2]": 190,
  "[Mn+3]": 320,
  "[Mn+4]": 205,
  "[Mn+6]": 568,
  "[Mn+]": 553,
  "[Mn]": 100,
  "[Mo+2]": 470,
  "[Mo+4]": 382,
  "[Mo+6]": 528,
  "[Mo]": 154,
  "[N+2]": 485,
  "[N+3]": 376,
  "[N+]": 41,
  "[N-3]": 294,
  "[N-]": 61,
  "[N@+]": 362,
  "[N@@+]": 356,
  "[N@@H+]": 486,
  "[N@@]": 242,
  "[N@H+]": 416,
  "[N@]": 244,
  "[NH+3]": 536,
  "[NH+]": 121,
  "[NH-]": 161,
  "[NH2+]": 116,
  "[NH2-]": 208,
  "[NH2]": 258,
  "[NH3+2]": 510,
  "[NH3+]": 107,
  "[NH4+]": 65,
  "[NH]": 153,
  "[N]": 177,
  "[Na+]": 46,
  "[Na-2]": 493,
  "[Na-]": 454,
  "[NaH]": 71,
  "[Na]": 49,
  "[Nb+3]": 581,
  "[Nb+4]": 580,
  "[Nb+5]": 312,
  "[Nb]": 366,
  "[Nd+3]": 277,
  "[Nd+]": 412,
  "[Nd]": 359,
  "[Ni+2]": 180,
  "[Ni+3]": 516,
  "[Ni+]": 446,
  "[Ni-]": 545,
  "[NiH2]": 566,
  "[NiH]": 544,
  "[Ni]": 96,
  "[O+]": 73,
  "[O-2]": 104,
  "[O-]": 36,
  "[OH+]": 261,
  "[OH-]": 59,
  "[OH2+]": 197,
  "[OH3+]": 328,
  "[OH]": 263,
  "[O]": 137,
  "[Os+2]": 453,
  "[Os+4]": 306,
  "[Os-2]": 175,
  "[Os]": 125,
  "[P+2]": 562,
  "[P+3]": 185,
  "[P+]": 91,
  "[P-3]": 577,
  "[P-]": 67,
  "[P@@H]": 498,
  "[P@@]": 203,
  "[P@H]": 537,
  "[P@]": 181,
  "[PAD]": 0,
  "[PH+]": 143,
  "[PH-]": 459,
  "[PH2+]": 414,
  "[PH2]": 164,
  "[PH3+]": 243,
  "[PH3]": 329,
  "[PH4+]": 230,
  "[PH4]": 452,
  "[PH5]": 354,
  "[PH]": 115,
  "[P]": 53,
  "[Pb+2]": 174,
  "[Pb+3]": 278,
  "[Pb+4]": 210,
  "[Pb]": 248,
  "[Pd+2]": 82,
  "[Pd+3]": 462,
  "[Pd+4]": 472,
  "[Pd+]": 141,
  "[Pd-2]": 273,
  "[Pd-]": 308,
  "[PdH2]": 307,
  "[Pd]": 50,
  "[Pr+3]": 374,
  "[Pr]": 286,
  "[Pt+2]": 145,
  "[Pt+4]": 165,
  "[Pt-2]": 241,
  "[Pt-]": 437,
  "[PtH+2]": 541,
  "[Pt]": 109,
  "[Rb+]": 315,
  "[Rb]": 386,
  "[Re+4]": 559,
  "[Re+5]": 543,
  "[Re]": 253,
  "[Rh+2]": 199,
  "[Rh+3]": 235,
  "[Rh+4]": 549,
  "[Rh+]": 292,
  "[Rh-3]": 216,
  "[Rh-]": 513,
  "[Rh]": 133,
  "[Ru+2]": 300,
  "[Ru+3]": 262,
  "[Ru+]": 254,
  "[Ru-2]": 492,
  "[Ru-]": 527,
  "[RuH2]": 394,
  "[RuH]": 417,
  "[Ru]": 117,
  "[S+2]": 288,
  "[S+4]": 311,
  "[S+]": 119,
  "[S-2]": 201,
  "[S-]": 112,
  "[S@+]": 220,
  "[S@@+]": 234,
  "[S@@]": 111,
  "[S@]": 108,
  "[SEP]": 13,
  "[SH+]": 236,
  "[SH-]": 173,
  "[SH2+]": 331,
  "[SH2]": 324,
  "[SH3+]": 341,
  "[SH5]": 504,
  "[SH]": 139,
  "[S]": 132,
  "[Sb+2]": 455,
  "[Sb+3]": 297,
  "[Sb+5]": 373,
  "[Sb+]": 515,
  "[Sb-]": 219,
  "[SbH2]": 448,
  "[SbH]": 487,
  "[Sb]": 200,
  "[Sc+2]": 552,
  "[Sc+3]": 214,
  "[Sc]": 334,
  "[Se+]": 575,
  "[Se-]": 321,
  "[SeH+]": 434,
  "[SeH-]": 436,
  "[SeH2]": 476,
  "[SeH]": 249,
  "[Se]": 126,
  "[Si+2]": 567,
  "[Si+4]": 245,
  "[Si+]": 383,
  "[Si-]": 250,
  "[Si@@H]": 344,
  "[Si@@]": 267,
  "[Si@H]": 204,
  "[Si@]": 268,
  "[SiH2]": 127,
  "[SiH3]": 151,
  "[SiH4+]": 556,
  "[SiH4]": 231,
  "[SiH]": 97,
  "[Si]": 47,
  "[Sm+2]": 353,
  "[Sm+3]": 325,
  "[Sm]": 255,
  "[Sn+2]": 168,
  "[Sn+3]": 365,
  "[Sn+4]": 282,
  "[Sn+]": 270,
  "[SnH2]": 371,
  "[SnH3]": 274,
  "[SnH4]": 342,
  "[SnH]": 150,
  "[Sn]": 80,
  "[Sr+2]": 246,
  "[Sr]": 351,
  "[Ta+5]": 348,
  "[TaH3]": 517,
  "[Ta]": 303,
  "[Tb+3]": 403,
  "[Tb]": 380,
  "[Tc]": 520,
  "[TeH2]": 478,
  "[TeH3]": 447,
  "[TeH]": 343,
  "[Te]": 226,
  "[Th+4]": 534,
  "[Th]": 296,
  "[Ti+2]": 269,
  "[Ti+3]": 198,
  "[Ti+4]": 129,
  "[Ti+5]": 496,
  "[Ti+6]": 411,
  "[Ti+]": 360,
  "[Ti]": 113,
  "[Tl+2]": 518,
  "[Tl+3]": 352,
  "[Tl+]": 304,
  "[Tl]": 347,
  "[U+2]": 396,
  "[U+6]": 433,
  "[UH]": 554,
  "[UNK]": 11,
  "[U]": 440,
  "[V+2]": 316,
  "[V+3]": 405,
  "[V+4]": 456,
  "[V+5]": 251,
  "[VH]": 505,
  "[V]": 223,
  "[W+4]": 421,
  "[W+6]": 406,
  "[W+]": 481,
  "[W]": 149,
  "[Xe+]": 546,
  "[Xe]": 390,
  "[Y+3]": 252,
  "[Y-]": 565,
  "[YH]": 372,
  "[Y]": 287,
  "[Yb+2]": 507,
  "[Yb+3]": 187,
  "[Yb]": 335,
  "[Zn+2]": 114,
  "[Zn+]": 136,
  "[Zn]": 87,
  "[Zr+2]": 189,
  "[Zr+3]": 291,
  "[Zr+4]": 176,
  "[Zr+]": 413,
  "[Zr-2]": 501,
  "[ZrH2]": 569,
  "[Zr]": 195,
  "[c+]": 314,
  "[c-]": 66,
  "[cH+]": 319,
  "[cH-]": 135,
  "[c]": 466,
  "[n+]": 79,
  "[n-]": 159,
  "[nH+]": 102,
  "[nH]": 40,
  "[o+]": 215,
  "[p-]": 542,
  "[pH]": 387,
  "[s+]": 183,
  "[sH+]": 338,
  "[se+]": 439,
  "[se]": 142,
  "[siH]": 428,
  "[te]": 232,
  "[unused10]": 10,
  "[unused1]": 1,
  "[unused2]": 2,
  "[unused3]": 3,
  "[unused4]": 4,
  "[unused5]": 5,
  "[unused6]": 6,
  "[unused7]": 7,
  "[unused8]": 8,
  "[unused9]": 9,
  "\\": 60,
  "b": 410,
  "c": 15,
  "n": 25,
  "o": 44,
  "p": 206,
  "s": 42,
  "~": 30
}
